tangyangguang/Esp32_Faucet/src/main.cpp
    bool ready() const override {
        return (fileStore_ && fileStore_->ready()) || ramStore_.ready();
    }

    const char* storageName() const override {
        return fileStore_ && fileStore_->ready() ? fileStore_->storageName() : ramStore_.storageName();
    }

private:
    faucet::WaterRecordCalibrationFileStore* fileStore_;
    faucet::WaterRecordCalibration calibrations_[kRamRecordCalibrationCapacity]{};
    faucet::WaterRecordCalibrationStore ramStore_;
};

class PersistentRecordMeteringSnapshotStore : public faucet::WaterRecordMeteringSnapshotReader,
                                             public faucet::WaterRecordMeteringSnapshotWriter {
public:
    PersistentRecordMeteringSnapshotStore()
        : fileStore_(nullptr), ramStore_(snapshots_, kRamRecordMeteringSnapshotCapacity) {}

    void setFileStore(faucet::WaterRecordMeteringSnapshotFileStore* store) {
        fileStore_ = store;
    }

    bool upsert(const faucet::WaterRecordMeteringSnapshot& snapshot) override {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->upsert(snapshot);
        }
        return ramStore_.upsert(snapshot);
    }

    bool find(const faucet::WaterRecord& record, faucet::WaterRecordMeteringSnapshot& output) const override {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->find(record, output);
        }
        return ramStore_.find(record, output);
    }

    std::size_t findAny(const faucet::WaterRecord* records,
                        std::size_t recordCount,
                        faucet::WaterRecordMeteringSnapshot* output,
                        bool* found) const override {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->findAny(records, recordCount, output, found);
        }
        return ramStore_.findAny(records, recordCount, output, found);
    }

    std::size_t count() const override {
        return fileStore_ && fileStore_->ready() ? fileStore_->count() : ramStore_.count();
    }

    bool ready() const override {
        return (fileStore_ && fileStore_->ready()) || ramStore_.ready();
    }

    const char* storageName() const override {
        return fileStore_ && fileStore_->ready() ? fileStore_->storageName() : ramStore_.storageName();
    }

private:
    faucet::WaterRecordMeteringSnapshotFileStore* fileStore_;
    faucet::WaterRecordMeteringSnapshot snapshots_[kRamRecordMeteringSnapshotCapacity]{};
    faucet::WaterRecordMeteringSnapshotStore ramStore_;
};

faucet::Esp32BaseConfigBackend g_configBackend;
faucet::ConfigStore g_configStore(g_configBackend);
faucet::SystemConfig g_config{};
faucet::StatisticsStore g_statistics;
faucet::FilterStore* g_filters = nullptr;
faucet::Esp32BaseWaterRecordBackend g_waterRecordBackend;
faucet::WaterRecordFileStore g_waterRecordFile(g_waterRecordBackend, kWaterRecordPath, kWaterRecordCapacity);
faucet::WaterRecordCalibrationFileStore g_recordCalibrationFile(
    g_waterRecordBackend,
    kWaterRecordCalibrationPath,
    kWaterRecordCalibrationCapacity);
faucet::WaterRecordMeteringSnapshotFileStore g_recordMeteringSnapshotFile(
    g_waterRecordBackend,
    kWaterRecordMeteringSnapshotPath,
    kWaterRecordMeteringSnapshotCapacity);
faucet::MeteringSchemeStore g_meteringSchemes(g_waterRecordBackend, kMeteringSchemePath);
faucet::CalibrationSessionFileStore g_calibrationSession(g_waterRecordBackend, kCalibrationSessionPath);
faucet::CalibrationSessionTraceStore g_calibrationSessionTraces(g_waterRecordBackend, kCalibrationSessionTracePath);
faucet::CalibrationLongTermSampleStore g_calibrationLongTermSamples(g_waterRecordBackend,
                                                                    kCalibrationLongTermSamplesPath);
faucet::WaterPulseTraceFileStore g_savedPulseTraceFile(
    g_waterRecordBackend,
    kSavedPulseTracePath,
    kSavedPulseTraceSamplesPerTrace,
    kSavedPulseTraceMaxCount);
PersistentRecordWriter g_records;
PersistentRecordCalibrationStore g_recordCalibrations;
PersistentRecordMeteringSnapshotStore g_recordMeteringSnapshots;
faucet::WaterPulseTrace* g_pulseTraceRecords = nullptr;
faucet::WaterPulseTraceSample* g_pulseTraceSamples = nullptr;
faucet::WaterPulseTraceStore* g_pulseTraces = nullptr;
faucet::AppController* g_app = nullptr;
faucet::GpioButtonReader g_buttons(faucet::kPinButtonCancel,
                                   faucet::kPinButtonOk,
                                   faucet::kPinButtonPlus,
                                   faucet::kPinButtonMinus);
faucet::FlowPulseReader g_flowPulses(faucet::kPinFlow);
faucet::PwmValveHardware g_valveHardware(faucet::kPinValve, faucet::kLedcChannelValve);
faucet::BeepDriver g_beep;
faucet::PwmBeepHardware g_beepHardware(faucet::kPinBeep, faucet::kLedcChannelBeep);
faucet::RtcClock g_rtc(faucet::kPinI2cSda, faucet::kPinI2cScl);
faucet::Lcd1602Display g_lcd(faucet::kPinI2cSda, faucet::kPinI2cScl);
faucet::DisplayPresenter* g_display = nullptr;
faucet::DisplayFrame g_lastDisplayFrame{faucet::DisplayPage::Sleep, false, {}, {}};
bool g_persistenceFailureLogged = false;
std::uint32_t g_lastDisplayMs = 0;
std::uint32_t g_lastDroppedPulsesLogged = 0;
std::uint32_t g_lastDroppedPulsesLogMs = 0;
bool g_bootRelativeTimesRewritten = false;
std::uint32_t g_lastLoopStartUs = 0;
std::uint32_t g_maxLoopIntervalUs = 0;
std::uint32_t g_maxAppTickUs = 0;
std::uint32_t g_maxBaseHandleUs = 0;

void configureBase() {
    Esp32Base::setFirmwareInfo(kFirmwareName, kFirmwareVersion, __DATE__ " " __TIME__);

#if ESP32BASE_ENABLE_WEB
    Esp32BaseWeb::setDefaultAuth(kDefaultWebUser, kDefaultWebPassword);
    Esp32BaseWeb::setDeviceName("首页");
    Esp32BaseWeb::setHomePath("/index");
    Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_COMBINED);
    Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_SECTION);
    if (!faucet::registerFaucetAppConfig()) {
        ESP32BASE_LOG_E("app", "app config registration failed");
    }
    if (!faucet::registerFaucetWeb()) {
        ESP32BASE_LOG_E("app", "faucet web route registration failed");
    }
#endif
}

