tangyangguang/Esp32_Faucet/src/main.cpp
void feedStartupWatchdog() {
#if ESP32BASE_ENABLE_WATCHDOG
    Esp32BaseWatchdog::feed();
#endif
}

void logStartupPhase(const char* phase) {
    ESP32BASE_LOG_D("app", "startup_phase=%s", phase ? phase : "-");
    feedStartupWatchdog();
}

void initializeI2cBus() {
    Wire.begin(faucet::kPinI2cSda, faucet::kPinI2cScl);
}

const char* configLoadStatusName(faucet::ConfigStore::LoadStatus status) {
    switch (status) {
        case faucet::ConfigStore::LoadStatus::DefaultsNoVersion:
            return "defaults_no_version";
        case faucet::ConfigStore::LoadStatus::LoadedCurrent:
            return "loaded_current";
        case faucet::ConfigStore::LoadStatus::MigratedLegacy:
            return "migrated_legacy";
        case faucet::ConfigStore::LoadStatus::LoadedFutureVersionReadOnly:
            return "future_version_read_only";
        case faucet::ConfigStore::LoadStatus::UnsupportedVersionDefault:
            return "unsupported_version_default";
    }
    return "unknown";
}

void logSystemConfigStatus() {
    const faucet::ConfigStore::LoadStatus status = g_configStore.lastSystemConfigLoadStatus();
    ESP32BASE_LOG_I("app",
                    "system config load status=%s raw_version=%ld target_version=%ld migrated_writeback=%s read_only=%s",
                    configLoadStatusName(status),
                    static_cast<long>(g_configStore.lastSystemConfigRawVersion()),
                    static_cast<long>(g_configStore.currentSystemConfigVersion()),
                    g_configStore.lastSystemConfigMigrationWriteBack() ? "yes" : "no",
                    g_configStore.systemConfigReadOnly() ? "yes" : "no");
    if (status == faucet::ConfigStore::LoadStatus::LoadedFutureVersionReadOnly) {
        ESP32BASE_LOG_W("app", "system config loaded from future version in read-only mode");
    } else if (status == faucet::ConfigStore::LoadStatus::UnsupportedVersionDefault) {
        ESP32BASE_LOG_W("app", "system config version unsupported, defaults used");
    }
}

void checkFileSystemCapacity() {
#if ESP32BASE_ENABLE_FS
    if (!Esp32BaseFs::isReady()) {
        return;
    }
    constexpr std::size_t kLowFreeBytes = 350UL * 1024UL;
    const std::size_t freeBytes = Esp32BaseFs::freeBytes();
    if (freeBytes < kLowFreeBytes) {
        ESP32BASE_LOG_W("app",
                        "LittleFS low free space: free=%lu total=%lu used=%lu",
                        static_cast<unsigned long>(freeBytes),
                        static_cast<unsigned long>(Esp32BaseFs::totalBytes()),
                        static_cast<unsigned long>(Esp32BaseFs::usedBytes()));
    }
#endif
}

bool canInitializeFixedCalibrationFile(const char* path, std::size_t requiredFreeBytes, const char* label) {
#if ESP32BASE_ENABLE_FS
    if (!Esp32BaseFs::isReady()) {
        return true;
    }
    if (g_waterRecordBackend.exists(path)) {
        return true;
    }
    const std::size_t freeBytes = Esp32BaseFs::freeBytes();
    if (freeBytes >= requiredFreeBytes) {
        return true;
    }
    ESP32BASE_LOG_W("app",
                    "skip %s init, LittleFS free space below gate: free=%lu required=%lu",
                    label ? label : "calibration file",
                    static_cast<unsigned long>(freeBytes),
                    static_cast<unsigned long>(requiredFreeBytes));
    return false;
#else
    (void)path;
    (void)requiredFreeBytes;
    (void)label;
    return true;
#endif
}

bool isLeapYear(std::uint16_t year) {
    return (year % 4U == 0 && year % 100U != 0) || year % 400U == 0;
}

std::uint16_t dayOfYear(std::uint16_t year, std::uint8_t month, std::uint8_t day) {
    static constexpr std::uint16_t kDaysBeforeMonth[] = {0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334};
    std::uint16_t value = kDaysBeforeMonth[month > 0 ? month - 1 : 0] + day - 1U;
    if (month > 2 && isLeapYear(year)) {
        ++value;
    }
    return value;
}

std::uint32_t daysSince2000(std::uint16_t year, std::uint8_t month, std::uint8_t day) {
    std::uint32_t days = 0;
    for (std::uint16_t y = 2000; y < year; ++y) {
        days += isLeapYear(y) ? 366UL : 365UL;
    }
    return days + dayOfYear(year, month, day);
}

std::uint32_t localSecondsFromUnix(std::uint32_t timestamp) {
    time_t value = static_cast<time_t>(timestamp);
    struct tm localTime {};
    localtime_r(&value, &localTime);
    const std::uint16_t year = static_cast<std::uint16_t>(localTime.tm_year + 1900);
    const std::uint8_t month = static_cast<std::uint8_t>(localTime.tm_mon + 1);
    const std::uint8_t day = static_cast<std::uint8_t>(localTime.tm_mday);
    return daysSince2000(year, month, day) * 86400UL + static_cast<std::uint32_t>(localTime.tm_hour) * 3600UL +
           static_cast<std::uint32_t>(localTime.tm_min) * 60UL + static_cast<std::uint32_t>(localTime.tm_sec);
}

std::uint32_t currentSeconds() {
#if ESP32BASE_ENABLE_NTP
    const Esp32BaseNtp::TimeSnapshot time = Esp32BaseNtp::snapshot();
    if (time.synced) {
        return localSecondsFromUnix(time.epochSec);
    }
    return time.uptimeSec;
#else
    return millis() / 1000UL;
#endif
}

std::uint32_t currentBootId() {
#if ESP32BASE_ENABLE_NTP
    return Esp32BaseNtp::snapshot().bootId;
#else
    return 0;
#endif
}

faucet::FaucetDisplayStatus currentDisplayStatus() {
    faucet::DisplayFrame physicalFrame = g_lastDisplayFrame;
    faucet::DisplayFrame logicalFrame = g_lastDisplayFrame;
    if (g_display && g_app) {
        const std::uint32_t nowMs = millis();
        const faucet::AppSnapshot snapshot = g_app->snapshot();
        physicalFrame = g_display->render(snapshot, nowMs);
        g_lastDisplayFrame = physicalFrame;
        faucet::DisplayPresenter awakePresenter(0);
        awakePresenter.wake(nowMs);
        logicalFrame = awakePresenter.render(snapshot, nowMs);
    }
    return faucet::FaucetDisplayStatus{logicalFrame, physicalFrame.on};
}

faucet::FaucetRuntimeDiagnostics currentRuntimeDiagnostics() {
    return faucet::FaucetRuntimeDiagnostics{g_maxLoopIntervalUs, g_maxAppTickUs, g_maxBaseHandleUs};
}

void applyRuntimeSettings(const faucet::SystemConfig& config) {
    g_beep.setEnabled(config.beepEnabled);
    if (g_display) {
        g_display->configure(config.displaySleepSec);
        g_display->wake(millis());
    }
    g_lcd.begin(config.lcdI2cAddress);
}

bool currentPeriodKeys(std::uint32_t nowSeconds, faucet::PeriodKeys& keys) {
    if (nowSeconds >= faucet::kMinRealDateSeconds) {
        std::uint32_t day = nowSeconds / 86400UL;
        std::uint16_t year = 2000;
        while (true) {
            const std::uint16_t yearDays = isLeapYear(year) ? 366 : 365;
            if (day < yearDays) {
                break;
            }
            day -= yearDays;
            ++year;
        }
        std::uint8_t month = 1;
        static constexpr std::uint8_t kMonthDays[] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
        while (month <= 12) {
            std::uint8_t monthDays = kMonthDays[month - 1];
            if (month == 2 && isLeapYear(year)) {
                monthDays = 29;
            }
            if (day < monthDays) {
                break;
            }
            day -= monthDays;
            ++month;
        }
        const std::uint8_t monthDay = static_cast<std::uint8_t>(day + 1);
        const std::uint32_t dayKey =
            static_cast<std::uint32_t>(year) * 10000UL + static_cast<std::uint32_t>(month) * 100UL + monthDay;
        const std::uint32_t weekKey = nowSeconds / 86400UL / 7UL;
        const std::uint32_t monthKey = static_cast<std::uint32_t>(year) * 100UL + month;
        keys = faucet::PeriodKeys{dayKey, weekKey, monthKey};
        return true;
    }
    const faucet::RtcDateTime now = g_rtc.readNow();
    if (!now.valid) {
        keys = faucet::PeriodKeys{0, 0, 0};
        return false;
    }
    const std::uint32_t rtcSeconds =
        daysSince2000(now.year, now.month, now.day) * 86400UL + static_cast<std::uint32_t>(now.hour) * 3600UL +
        static_cast<std::uint32_t>(now.minute) * 60UL + static_cast<std::uint32_t>(now.second);
    if (rtcSeconds < faucet::kMinRealDateSeconds) {
        keys = faucet::PeriodKeys{0, 0, 0};
        return false;
    }

    const std::uint32_t dayKey = static_cast<std::uint32_t>(now.year) * 10000UL +
                                 static_cast<std::uint32_t>(now.month) * 100UL + now.day;
    const std::uint32_t weekKey = daysSince2000(now.year, now.month, now.day) / 7UL;
    const std::uint32_t monthKey =
        static_cast<std::uint32_t>(now.year) * 100UL + static_cast<std::uint32_t>(now.month);
    keys = faucet::PeriodKeys{dayKey, weekKey, monthKey};
    return true;
}

